In [2]:
import numpy as np
import pandas as pd

In [14]:
df = pd.DataFrame(
    {
        "Name": np.random.choice(["Shah", "Kumar", "Vats"], 10),
        "Gender": np.random.choice(["Male", "Female"], 10),
        "MonthlyIncome": np.random.choice(np.arange(50_000, 120_000), 10),
    }
)
df

    Name  Gender  MonthlyIncome
0   Shah  Female          78585
1  Kumar  Female          91551
2   Vats    Male          95518
3   Shah  Female         103163
4   Shah    Male          69361
5  Kumar    Male          62117
6  Kumar    Male          69354
7   Vats    Male         119588
8   Shah    Male          67885
9   Vats  Female          88821

In [21]:
df.groupby("Name").sum()

                     Gender  MonthlyIncome
Name
Kumar        FemaleMaleMale         223022
Shah   FemaleFemaleMaleMale         318994
Vats         MaleMaleFemale         303927

In [41]:
df.iloc[df.groupby("Name")["MonthlyIncome"].idxmax()]

    Name  Gender  MonthlyIncome
1  Kumar  Female          91551
3   Shah  Female         103163
7   Vats    Male         119588

In [62]:
df[df["MonthlyIncome"] > 70000][["Name", "MonthlyIncome"]]

    Name  MonthlyIncome
0   Shah          78585
1  Kumar          91551
2   Vats          95518
3   Shah         103163
7   Vats         119588
9   Vats          88821

In [79]:
df.groupby("Name").mean("MonthlyIncome")

       MonthlyIncome
Name
Kumar   74340.666667
Shah    79748.500000
Vats   101309.000000